Управление_торговлей.ПБТ/src/Documents/УтверждениеНорматива/УтверждениеНорматива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеНорматива</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <basedOn>Document.УтверждениеНорматива</basedOn>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСырья</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребованияККачеству</name>
    <type>
      <types>DocumentRef.ТребованияККачествуЗакупаемогоТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Утвердил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/ТребованияККачествуЗакупаемогоТовара/ТребованияККачествуЗакупаемогоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТребованияККачествуЗакупаемогоТовара</name>
  <registerRecords>InformationRegister.НормативыНоменклатурыЛаб</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСырья</name>
    <type>
      <types>CatalogRef.ВидыСырья</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеДляВидаСырья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОККЗаАнализРазногласий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаЦИРПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаОККПоРазногласиямЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АллергеныЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияТребований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеНеобходимо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РН</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>История</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаЦПБЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаОККЗавершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПищеваяЦенность</name>
    <attributes>
      <name>Ценность</name>
      <type>
        <types>CatalogRef.ПищевыеЦенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеРегламенты</name>
    <attributes>
      <name>ПродуктУпаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Регламент</name>
      <type>
        <types>CatalogRef.ТехническиеРегламенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтНасНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Любая дополнительная информация</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтНасАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяАнглийский</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеВыводитьВСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяОтПоставщикаНачальные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяКонечные</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КтоВнес</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КогдаВнес</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтличаетсяОтТР_ТС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьСторонняя</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНорматива</name>
      <type>
        <types>CatalogRef.ХарактеристикиНормативов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/УтверждениеНорматива/Forms/ФормаОбновленияИзТребования/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТребованияККачеству") Тогда
		Требование = Параметры.ТребованияККачеству;
		УтверждениеНорматива = Параметры.УтверждениеНорматива;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Утверждение.Показатель КАК Показатель,
		               |	Утверждение.ВидИсследования КАК ВидИсследования,
		               |	Утверждение.ЗначениеПоказателя КАК ЗначениеПоказателя,
		               |	Утверждение.Периодичность КАК Периодичность,
		               |	Требование.ПоказательТреб КАК ПоказательТреб,
		               |	Требование.ВидИсследованияТреб КАК ВидИсследованияТреб,
		               |	Требование.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяТреб,
		               |	Требование.ПериодичностьТреб КАК ПериодичностьТреб,
		               |	ИСТИНА КАК Обновлять,
		               |	Требование.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяКонечные,
		               |	Утверждение.ВариантСравнения КАК ВариантСравнения,
		               |	Утверждение.Интервал КАК Интервал,
		               |	Требование.ВариантСравненияТреб КАК ВариантСравненияТреб,
		               |	Требование.ИнтервалТреб КАК ИнтервалТреб,
		               |	Требование.ПериодичностьСторонняя КАК ПериодичностьСторонняя
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		УтвПоказатели.Показатель КАК Показатель,
		               |		УтвПоказатели.Показатель.ВидИсследования КАК ВидИсследования,
		               |		УтвПоказатели.Значение КАК ЗначениеПоказателя,
		               |		УтвПоказатели.Периодичность КАК Периодичность,
		               |		УтвПоказатели.ВариантСравнения КАК ВариантСравнения,
		               |		УтвПоказатели.Интервал КАК Интервал
		               |	ИЗ
		               |		Документ.УтверждениеНорматива.ТЧ_Показатели КАК УтвПоказатели
		               |	ГДЕ
		               |		УтвПоказатели.Ссылка = &УтверждениеНорматива) КАК Утверждение
		               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ТребовПоказатели.Показатель КАК ПоказательТреб,
		               |			ТребовПоказатели.ВидИсследования КАК ВидИсследованияТреб,
		               |			ТребовПоказатели.Периодичность КАК ПериодичностьТреб,
		               |			ТребовПоказатели.ЗначениеПоказателяКонечные КАК ЗначениеПоказателяКонечные,
		               |			ТребовПоказатели.Ссылка.Статус КАК Статус,
		               |			ТребовПоказатели.ВариантСравнения КАК ВариантСравненияТреб,
		               |			ТребовПоказатели.Интервал КАК ИнтервалТреб,
		               |			ТребовПоказатели.ПериодичностьСторонняя КАК ПериодичностьСторонняя
		               |		ИЗ
		               |			Документ.ТребованияККачествуЗакупаемогоТовара.ТЧ_Показатели КАК ТребовПоказатели
		               |		ГДЕ
		               |			ТребовПоказатели.Ссылка = &Требование
		               |			И НЕ ТребовПоказатели.Периодичность = ЗНАЧЕНИЕ(Справочник.ПериодичностьИспытаний.ПустаяСсылка)) КАК Требование
		               |		ПО Утверждение.Показатель = Требование.ПоказательТреб";
		
		Запрос.УстановитьПараметр("УтверждениеНорматива", УтверждениеНорматива);
		Запрос.УстановитьПараметр("Требование", Требование);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НовСтр = ТЗПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			
			//Если НовСтр.ВариантСравненияТреб = Перечисления.ВариантыСравнения.Между Тогда
			//	ЗначКон = НовСтр.ЗначениеПоказателяТреб;
			//	Дефис = Найти(ЗначКон, "-");
			//	Если Дефис>0 Тогда
			//		НовСтр.ЗначениеПоказателяТреб = Сред(ЗначКон, 1, Дефис-1);
			//		НовСтр.ИнтервалТреб = Сред(ЗначКон, Дефис+1);
			//	КонецЕсли; 
			//КонецЕсли; 
			
		КонецЦикла;
		
		//ЭлементыФормы.ТЗПоказатели.ОбновитьСтроки();
		
		Если ЗначениеЗаполнено(Требование) Тогда
			Элементы.КомментарийТребования.Заголовок = "Коммент в требовании: "+Требование.Комментарий;		
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередатьДанныеВОсновнуюформуНаСервере(АдресВХ)
	
	ТЗ = РеквизитФормыВЗначение("ТЗПоказатели");
	АдресВХ = ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	АдресВХ = Неопределено;
	ПередатьДанныеВОсновнуюформуНаСервере(АдресВХ);
	
	ПараметрыПриЗакрытии = Новый Структура;
	ПараметрыПриЗакрытии.Вставить("АдресВХ",АдресВХ);
	
	//ВладелецФормы.ОбработатьПодбор(ПараметрыПриЗакрытии);
	//Закрыть(ПараметрыПриЗакрытии);
	ОповеститьОВыборе(ПараметрыПриЗакрытии);	
	//Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВсеНаСервере(Галочка)
	Для каждого Стр Из ТЗПоказатели Цикл
	    Стр.Обновлять = Галочка
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УбратьВсе(Команда)
	ИзменитьВсеНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьВсе(Команда)
	ИзменитьВсеНаСервере(Истина);
КонецПроцедуры
